run/porousPimpleFoam/cases/setups/cylinder_1d/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         600;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   30;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;

functions
{
    volFieldValue1
    {
        // Mandatory entries (unmodifiable)
        type            volFieldValue;
        libs            (fieldFunctionObjects);
    
        // Mandatory entries (runtime modifiable)
        fields          (Tf Ts);
        operation       average;
        regionType      all;
    
        writeFields     true;
        writeControl    writeTime;
        writeInterval   -1;
    }
}

// ************************************************************************* //
